cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/versions"
tap "railwaycat/emacsmacport"
tap "universal-ctags/universal-ctags"

cask "java"
cask "xquartz"

brew "ack"
brew "autoconf"
brew "python"
brew "awscli"
brew "ctags", link: false
brew "go"
brew "dep"
brew "elixir"
brew "ffmpeg"
brew "flow"
brew "gifsicle"
brew "libtool"
brew "ispell"
brew "libgpg-error"
brew "libksba"
brew "libyaml"
brew "lua"
brew "lynx"
brew "makedepend"
brew "mongodb"
brew "neovim"
brew "node", link: false
brew "nvm"
brew "perl"
brew "postgresql", restart_service: true
brew "redis", restart_service: true
brew "ruby"
brew "s3cmd"
brew "the_silver_searcher"
brew "tree"
brew "vim", args: ["with-lua"]
brew "watchman"
brew "yarn", args: ["without-node"]
brew "z"
brew "heroku/brew/heroku"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
