tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/versions"
tap "universal-ctags/universal-ctags"
brew "python"
brew "ctags", link: false
brew "httpie"
brew "lua"
brew "node", link: false
brew "nvm"
brew "perl"
brew "postgresql", restart_service: true
brew "redis", restart_service: true
brew "ruby"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim", args: ["with-lua"]
brew "yarn", args: ["without-node"]
brew "z"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
